# WallTaperedExteriorInwardAngle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallTaperedExteriorInwardAngle Property
ParameterTypeId Class See Also
---
"Exterior Angle"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallTaperedExteriorInwardAngle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallTaperedExteriorInwardAngle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallTaperedExteriorInwardAngle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace